{
    "type": "FeatureCollection",
    "features": [
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -77.036871,
                    38.907192
                ]
            },
            "properties": {
                "entry": "jqadiaries-v46-1848-01-p243--entry2",
                "link": "https://www.primarysourcecoop.org/publications/jqa/document/jqadiaries-v46-1848-01-p243--entry2",
                "date": "1848-01-02",
                "dateline": "Washington Sunday 2d. January 1848.",
                "entity": "Washington",
                "geocode_string": "Washington, DC",
                "text": "2. VI.  I attended Public Worship in the morning at the Hall of the House of Representatives where Mr. Slicer the Chaplain of the Senate preached, and in the Afternoon a member of the Society of Friends preached in the Hall, which I also attended, but I had not the attention to note down at the time the text of either of the Preachers— "
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -77.036871,
                    38.907192
                ]
            },
            "properties": {
                "entry": "jqadiaries-v46-1848-01-p243--entry3",
                "link": "https://www.primarysourcecoop.org/publications/jqa/document/jqadiaries-v46-1848-01-p243--entry3",
                "date": "1848-01-03",
                "dateline": "Washington Monday 3d. January 1848.",
                "entity": "Washington",
                "geocode_string": "Washington, DC",
                "text": "3. VI.  In the House the Debate relating to the transportation of the Southern Mail, was after some discussion made the special order of the day for tomorrow. George. W. Jones of Tennessee offered a Resolution that the Committee on Revolutionary Pensions, be instructed to enquire into the expediency and propriety of authorizing the Secretary of War, to employ additional Clerks, in the Pension Office temporary that the Committee report as soon as practicable. Cock of Tennessee moved as an Amendment that the Commissioner of Pensions be authorized to employ the temporary Clerks, instead of the Secretary of War—the original Resolution prevailed. Thompson of Indiana from the Committee on Elections reported a Resolution for taking testimony in the Election contested by James Munroe— By a Rule of the House on every alternate Monday during the Session the States are called for Resolutions and this was the day assigned for that purpose. Numerous Resolutions were accordingly offered, some of them adopted and most of them laid over for future consideration— Charles Hudson of Massachusetts offered a Resolution to instruct the Committee on Military Affairs to enquire into the expediency of requesting the President to withdraw our Armies now in Mexico to the East Bank of the Rio Grand and to propose a Treaty of Peace to the Mexican Government, with the Boundary of thebetween the Nueces and the Rio Grand. Hudson called for the Previous Question— Jacob Thompson of Mississippi moved to lay the Resolution on the Table. Thompson withdrew his motion, which was renewed by Stevens of Georgia. Cobb of Georgia objected that it was not in order to move to lay a Bill or Resolution on the Table. After the House had directed the Main Question to be put— The Speaker decided it was in order and his decision was sustained by the House— Charles. J. Ingersoll moved a Resolution that the President be requested to inform the House whether any official notice has been taken by this Government or its Minister in England by correspondence or otherwise of the threatening and offensive terms in which the British Secretary for Foreign Affairs is credibly reported to have spoken in his place in the Commons House of Parliament lately, of what he treated as the want of Public faith in the United States punishable by Great Britain. John. W. Houston of Delaware in pursuance of previous notice moved a Resolution of thanks to General Zachary Taylor and his Army for the Battle of Buena Vista and that the President be requested to cause to be struck a gold medal to be presented to Major General Taylor. Evans of Maryland offered an Amendment, but Houston moved the Previous Question in the original Resolution; it was not seconded. A motion was made to refer the Resolution to the Committee on Military Affairs. Henley of Indiana moved to amend, by adding an instruction to the Committee, to add the words engaged as they were in defending the rights, and honor of the nation. Henley called for the yeas and nays. George Ashmun of Mass. moved to amend the Amendment by adding the words, in a War unnecessarily and unconstitutionally begun by the President of the United States. The yeas and nays were taken on this Amendment and it was carried by a vote of 85 to 81— Cobb of Georgia said that the Amendments presented such a remarkable issue that he must propose to discuss it— The resolution was therefore laid over to be debated tomorrow— John. A. Rockwell of Connecticut introduced a Bill to revise the Consular System of the United States which was referred to the Committee on Foreign Affairs— About three oclock P.M. the House adjourned— "
            }
        },
        {
            "type": "Feature",
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -77.036871,
                    38.907192
                ]
            },
            "properties": {
                "entry": "jqadiaries-v46-1848-01-p243--entry4",
                "link": "https://www.primarysourcecoop.org/publications/jqa/document/jqadiaries-v46-1848-01-p243--entry4",
                "date": "1848-01-04",
                "dateline": "Washington Tuesday 4th. January 1848—",
                "entity": "Washington",
                "geocode_string": "Washington, DC",
                "text": "4. VI.  At the House this morng Mr. Goggin offered the Resolutions in relation to the great Southern Mail as the special order for the day, but moved that a reconsideration of the vote, with an amendment to make it the order of the day for tomorrow— Mr. Botts supported the motion. After some debate the resolution was agreed to— The House then went in Committee of the whole on the State of the Union upon the Presidents Message. Brodhead ofoffered several Resolutions, as a substitute. Smith ofrose to a point of order. Brodhead resumed the floor and addressed the Committee. Giddings of Ohio. "
            }
        }
    ]
}